src/DataProcessors/ПоискPLU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПоискPLU</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеВвода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ПоискPLU/Forms/Форма9/module.bsl
#Область ОписаниеПеременных

Перем фЗакрыть;
Перем ТоваровНаСтранице;

#КонецОбласти


#Область ОбработчикиСобытийФормы

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура ПриОткрытии()
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);

	ЭлементыФормы.НадписьЗаголовок.Заголовок = ЭтаФорма.Заголовок;	
	Если глПараметрыРМ.ОбрезкаОкон Тогда
		
	Иначе
		//Заголовок = "";
	КонецЕсли;

	ЗаполнитьТовары(Товары);
	
	ЭлементыФормы.ОК.Заголовок = ?(ПустаяСтрока(глПараметрыРМ.ИмяПринтераВесы), "ОК", "ПЕЧАТЬ");
	
	Стиль = БиблиотекаСтилей.СтанцияОплаты;
	ОбновитьЗаголовок();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	//Офлайн
	Отказ = глПараметрыРМ.ФайловаяИБ;
КонецПроцедуры

Процедура ПриЗакрытии()
	ИнтерфейсРМ.ПриЗакрытииОкна();
	Если глПараметрыРМ.ВесыЕсть Тогда
		Весы = Обработка_Весы.DRV;
		//Весы = глТорговоеОборудование.Scale1C;
		Весы.ВесТары = 0;
		Весы.УстановитьТару();
	КонецЕсли;
	ОтключитьОбработчикОжидания("Поиск");
	ОтключитьОбработчикОжидания("ОбновитьЗаголовок");
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)

	ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ЗначениеВводаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("Поиск",0.1,1);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормытпТовары

Процедура тпТоварыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Вес > 0 И ВесСтабилен Тогда
		ОК();	
	КонецЕсли;
КонецПроцедуры

Процедура тпТоварыПриАктивизацииСтроки(Элемент)
	Если ЭлементыФОрмы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Товар = Справочники.Товары.ПустаяСсылка();
		ШК = "";
	Иначе
		Товар = ЭлементыФормы.тпТовары.ТекущиеДанные.Товар;
		ШК = ЭлементыФормы.тпТовары.ТекущиеДанные.ШК;
		ОбновитьЗаголовок();	
	КонецЕсли;
	
	Если НЕ глПараметрыРМ.ФайловаяИБ Тогда
		глОтсечкаПростоя();
	КонецЕсли;
	
	//тпТоварыВыбор(Элемент, ЭлементыФормы.тпТовары.ТекущаяСтрока, "", Ложь);
КонецПроцедуры

Процедура тпТоварыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	стрЦена = Формат(ДанныеСтроки.Цена, "ЧДЦ=2; ЧРД=.");
	Если ДанныеСтроки.Цена = Цел(ДанныеСтроки.Цена) Тогда
		стрЦена = СтрЗаменить(стрЦена, ".00", ".-");
	КонецЕсли;
	
	стрЦена = стрЦена + " " + глСимволРубля;
	ОформлениеСтроки.Ячейки.Цена.УстановитьТекст(стрЦена);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура БэкспейсНажатие(Элемент)
	ЗначениеВвода = СокрП(ЗначениеВвода);
	ЗначениеВвода = Лев(ЗначениеВвода, СтрДлина(ЗначениеВвода)-1);
	НажатиеКнопки("");
КонецПроцедуры


#Область ЦифроваяПанель

Процедура Кнопка7Нажатие(Элемент)
	
	НажатиеКнопки("7");
	
КонецПроцедуры

Процедура Кнопка8Нажатие(Элемент)
	
	НажатиеКнопки("8");
	
КонецПроцедуры

Процедура Кнопка9Нажатие(Элемент)
	
	НажатиеКнопки("9");
	
КонецПроцедуры

Процедура Кнопка4Нажатие(Элемент)
	
	НажатиеКнопки("4");
	
КонецПроцедуры

Процедура Кнопка5Нажатие(Элемент)
	
	НажатиеКнопки("5");
	
КонецПроцедуры

Процедура Кнопка6Нажатие(Элемент)
	
	НажатиеКнопки("6");
	
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	НажатиеКнопки("1");
	
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	
	НажатиеКнопки("2");
	
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	
	НажатиеКнопки("3");
	
КонецПроцедуры

Процедура Кнопка0Нажатие(Элемент)
	
	НажатиеКнопки("0");
	
КонецПроцедуры

Процедура КнопкаСбросНажатие(Элемент)
	
	Товары.Очистить();
	ОтключитьОбработчикОжидания("Поиск");
	Сброс();
	
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
	фЗакрыть = Истина;
	Закрыть("");
КонецПроцедуры

#КонецОбласти


#Область Весы

Процедура НольНажатие(Элемент)
	Если глПараметрыРМ.ВесыЕсть Тогда
		Весы = Обработка_Весы.DRV;
		//Весы = глТорговоеОборудование.Scale1C;
		Весы.Ноль();
	КонецЕсли;
	
	Если НЕ глПараметрыРМ.ФайловаяИБ Тогда
		глОтсечкаПростоя();
	КонецЕсли;
КонецПроцедуры

Процедура ТНажатие(Элемент)
	Если глПараметрыРМ.ВесыЕсть Тогда
		Весы = Обработка_Весы.DRV;
		//Весы = глТорговоеОборудование.Scale1C;
		Весы.Тара();
	КонецЕсли;
	
	Если НЕ глПараметрыРМ.ФайловаяИБ Тогда
		глОтсечкаПростоя();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


Процедура КнопкаОКНажатие(Элемент)
	
	ОК();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Поиск() Экспорт
	мДобавленныеТовары = Новый Массив;
	Товары.Очистить();
	Для каждого стр из ТаблицаПоиска Цикл
		Поз = найти(Стр.plu,ЗначениеВвода);
		Если Поз <> 0 Тогда
			стр.Представление = стр.наименование;
			ЗаполнитьЗначенияСвойств(товары.Добавить(),Стр);
			Стр.ПозицияСовпадения = Поз;
			ЭлементыФормы.тпТовары.ТекущаяСтрока = Товары[0];
		КонецЕсли;
	КонецЦикла;
	Если Товары.Количество() Тогда
		Товары.Сортировать("ПозицияСовпадения");
		ЭлементыФормы.тпТовары.ТекущаяСтрока = Товары[0];
	КонецЕсли;
	ОбновитьЗаголовок();
КонецПроцедуры

Процедура НажатиеКнопки(СтрКнопки) Экспорт
	
	ОтключитьОбработчикОжидания("Поиск");
	ФормаВвода = ЭтаФорма;
	Если ФормаВвода.ЭлементыФормы.ЗначениеВвода.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	
	НовЗнач = ЗначениеВвода;
	
	НовЗнач = НовЗнач + СтрКнопки;	
	
	ЗначениеВвода = НовЗнач;
	Если СтрДлина(НовЗнач) > 2 Тогда
		ПодключитьОбработчикОжидания("Поиск",0.1,1);
	ИначеЕсли СтрДлина(НовЗнач) Тогда 
		ПодключитьОбработчикОжидания("Поиск",1.5,1);
	Иначе
		ОтключитьОбработчикОжидания("Поиск");
	КонецЕсли;
	
	Если НЕ глПараметрыРМ.ФайловаяИБ Тогда
		глОтсечкаПростоя();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьЗаголовок() Экспорт
	ОтключитьОбработчикОжидания("ОбновитьЗаголовок");
	Если Товары.Количество() <> 0 и ЭлементыФормы.тпТовары.ТекущиеДанные <> Неопределено тогда
		//ОбновитьВес();
		Цена = ЭлементыФормы.тпТовары.ТекущиеДанные.Цена;
		Сумма = Окр(Цена*Вес,2);
		ЭлементыФормы.НадписьЗаголовок.Заголовок = "Вес: " + Формат(Вес,"ЧДЦ=3; ЧРД=.; ЧН=0.000") + "      Цена: " + Формат(Цена,"ЧДЦ=2; ЧРД=.; ЧН=0.00") + "        Сумма: " + Формат(Сумма,"ЧДЦ=2; ЧРД=.; ЧН=0.00");
	Иначе
		ЭлементыФормы.НадписьЗаголовок.Заголовок = "Вес: " + Формат(Вес,"ЧДЦ=3; ЧРД=.; ЧН=0.000") + "      Цена: 0.00        Сумма: 0.00";
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновитьЗаголовок", 0.1, Истина);
КонецПроцедуры


#Область Офлайн

Процедура КнопкаПечатьНажатиеОфлайн(Элемент) Экспорт 
	Печать(Вес);	
КонецПроцедуры

Процедура тпТоварыВыборОфлайн(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка) Экспорт 
	Если Вес > 0 И ВесСтабилен Тогда
		Печать(Вес);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецОбласти


#Область Инициализация

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

ТоваровНаСтранице = 15;

//ВЕСЫ
Если глПараметрыРМ.ВесыЕсть Тогда
	Весы = глПараметрыРМ.Весы.ПолучитьОбъект();
	Обработка_Весы = Обработка_Весы;
	ИнициализацияТО(Весы, Обработка_Весы, глПараметрыРМ);
КонецЕсли;

#КонецОбласти
